Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.fi-se.tmx
Source language: fi
Languages: se

source: Vahinkojen vaara pienenee ja työnteko tehostuu.
se: Arbetsmiljön behöver alltså förbättras.

source: Putoamisriskin vähentäminen
se: vara hållfasta,

source: ja tarkastus
se: Nödbelysning

source: Katsastus on suoritettava Ruotsin sääntöjen mukaisesti.
se: I utrymningsvägar där belysning är nödvändig ska det också finnas nödbelysning.

source: Muuta huomiotavaa…
se: Kontrollera utrustning och installationer

source: Aliurakointitapauksissa rakennuttajan vastuuta ei voi siirtää.
se: Val av arbetsmetoder och utrustning

source: Työsuojeluvaltuutettu edustaa työntekijöitä turvakysymyksissä.
se: Skyddsronder
